<!DOCTYPE html>
<html lang="pt-br">

<head>
  <meta charset="utf-8">
  <meta content="width=device-width, initial-scale=1.0" name="viewport">

  <title>Cantinho do Docker</title>
  <meta content="" name="descriptison">
  <meta content="" name="keywords">

  <!-- Favicons -->
  <link href="../assets/img/favicon.png" rel="icon">
  <link href="../assets/img/apple-touch-icon.png" rel="apple-touch-icon">

  <!-- Google Fonts -->
  <link href="https://fonts.googleapis.com/css?family=Open+Sans:300,300i,400,400i,600,600i,700,700i|Montserrat:300,300i,400,400i,500,500i,600,600i,700,700i|Poppins:300,300i,400,400i,500,500i,600,600i,700,700i" rel="stylesheet">

  <!-- Vendor CSS Files -->
  <link href="../assets/vendor/bootstrap/css/bootstrap.min.css" rel="stylesheet">
  <link href="../assets/vendor/icofont/icofont.min.css" rel="stylesheet">
  <link href="../assets/vendor/boxicons/css/boxicons.min.css" rel="stylesheet">
  <link href="../assets/vendor/venobox/venobox.css" rel="stylesheet">
  <link href="../assets/vendor/owl.carousel/../assets/owl.carousel.min.css" rel="stylesheet">
  <link href="../assets/vendor/aos/aos.css" rel="stylesheet">

  <!-- Template Main CSS File -->
  <link href="../assets/css/style.css" rel="stylesheet">

  <!-- =======================================================
  * Template Name: Knight - v2.1.0
  * Template URL: https://bootstrapmade.com/knight-free-bootstrap-theme/
  * Author: BootstrapMade.com
  * License: https://bootstrapmade.com/license/
  ======================================================== -->
</head>

<body>

  <!-- ======= Header ======= -->
  <header id="header" class="d-flex align-items-center">
    <div class="container">

      <nav class="nav-menu d-none d-lg-block">
        <ul class="nav-inner">
          <li class="active"><a href="index.html">Início</a></li>
          <li class="drop-down"><a href="#">Introdução</a>
              <ul>
                  <li><a href="../introducao/index.html">Introdução</a></li>
                  <li><a href="../introducao/inst-linux.html">Instalação no Linux</a></li>
                  <li><a href="../introducao/inst-win.html">Instalação no Windows</a></li>
                  <li><a href="../introducao/linux.html">Comandos do Linux</a></li>
                  <li><a href="../introducao/redes.html">Redes no Docker</a></li>
                  <li><a href="../introducao/volumes.html">Volumes no Docker</a></li>
              </ul>
          </li>
          <li class="drop-down"><a href="">Projeto</a>
            <ul>
              <li><a href="../projeto/index.html">Projeto</a></li>
              <li><a href="../projeto/boas-praticas.html">Boas Práticas</a></li>
              <li><a href="../projeto/estrutura.html">Estrutura</a></li>
            </ul>
          </li>

          <li class="drop-down"><a href="#">Conceitos</a>
            <ul>
              <li><a href="index.html">Conceitos</a></li>
              <li><a href="containers.html">Containers</a></li>
              <li><a href="docker.html">Docker</a></li>
              <li><a href="imagens.html">Imagens</a></li>
            </ul>
          </li>
          <li class="drop-down"><a href="#">Comandos</a>
            <ul>
              <li><a href="../comandos/index.html">Comandos</a></li>
              <li><a href="../comandos/comandos1.html">Comandos 1</a></li>
              <li><a href="../comandos/comandos2.html">Comandos 2</a></li>
            </ul>
          </li>

          <li class="drop-down"><a href="#">Imagens</a>
            <ul>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/CMS/Simples" target="_blank">CMS simples</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/Git" target="_blank">Git</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/GitHub" target="_blank">GitHub</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/Matematica" target="_blank">Matemática</a></li>
              <li><a href="ttps://github.com/ribafs/prog-web/tree/main/Ferramentas/VSCode" target="_blank">VSCode</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/faker2" target="_blank">Faker</a></li>
              <li><a href="https://github.com/ribafs/web-share" target="_blank" title="Compartilhar seu servidor web">Web Share</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas" target="_blank">Outras</a></li>
            </ul>
          </li>
          <li class="drop-down"><a href="#">Tutoriais</a>
            <ul>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/CMS/Simples" target="_blank">CMS simples</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/Git" target="_blank">Git</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/GitHub" target="_blank">GitHub</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/Matematica" target="_blank">Matemática</a></li>
              <li><a href="ttps://github.com/ribafs/prog-web/tree/main/Ferramentas/VSCode" target="_blank">VSCode</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/faker2" target="_blank">Faker</a></li>
              <li><a href="https://github.com/ribafs/web-share" target="_blank" title="Compartilhar seu servidor web">Web Share</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas" target="_blank">Outras</a></li>
            </ul>
          </li>

          <li class="drop-down"><a href="#">Containers</a>
            <ul>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/CMS/Simples" target="_blank">CMS simples</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/Git" target="_blank">Git</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/GitHub" target="_blank">GitHub</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/Matematica" target="_blank">Matemática</a></li>
              <li><a href="ttps://github.com/ribafs/prog-web/tree/main/Ferramentas/VSCode" target="_blank">VSCode</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas/faker2" target="_blank">Faker</a></li>
              <li><a href="https://github.com/ribafs/web-share" target="_blank" title="Compartilhar seu servidor web">Web Share</a></li>
              <li><a href="https://github.com/ribafs/prog-web/tree/main/Ferramentas" target="_blank">Outras</a></li>
              <li><a href="ferramentas.html" target="_blank">Ferramentas</a></li>
            </ul>
          </li>

          <li class="drop-down"><a href="#">Sobre</a>
            <ul>
              <li><a href="../livros">Meus livros</a></li>
              <li><a href="https://github.com/ribafs/" target="_blank">Meus Projetos</a></li>
              <li><a href="../curriculo.html">Currículo</a></li>
              <li><a href="../contato.html">Contato</a></li>
            </ul>
          </li>

        </ul>
      </nav><!-- .nav-menu -->
    </div>
  </header><!-- End Header -->

  <main id="main">

    <!-- ======= About Us Section ======= -->
    <section>
      <div class="container">

          <h2 class="text-center">Docker</h2>
<div class="text-left">
<div class="row">
<div class="col-md-2"></div>
<div class="col-md-8">

<p><b>O que &eacute; Docker?</b></p>

<p>De forma resumida, o Docker &eacute; uma plataforma de c&oacute;digo aberto, desenvolvido na linguagem Go e criada pelo pr&oacute;prio Docker.Inc. Por ser de alto desempenho, o software garante maior facilidade na cria&ccedil;&atilde;o e administra&ccedil;&atilde;o de ambientes isolados, garantindo a r&aacute;pida disponibiliza&ccedil;&atilde;o de programas para o usu&aacute;rio final.</p>

<p>Primeiro temos que definir o que n&atilde;o &eacute; Docker. Docker n&atilde;o &eacute; um sistema de virtualiza&ccedil;&atilde;o tradicional. Enquanto em um ambiente de virtualiza&ccedil;&atilde;o tradicional n&oacute;s temos um S.O. completo e isolado, dentro do Docker n&oacute;s temos recursos isolados que utilizando bibliotecas de kernel em comum (entre host e container), isso &eacute; poss&iacute;vel pois o Docker utiliza como backend o nosso conhecido LXC.</p>

<p>Docker &eacute; uma plataforma Open Source escrito em Go, que &eacute; uma linguagem de programa&ccedil;&atilde;o de alto desempenho desenvolvida dentro do Google, que facilita a cria&ccedil;&atilde;o e administra&ccedil;&atilde;o de ambientes isolados.</p>

<p>O Docker possibilita o empacotamento de uma aplica&ccedil;&atilde;o ou ambiente inteiro dentro de um container, e a partir desse momento o ambiente inteiro torna-se port&aacute;vel para qualquer outro Host que contenha o Docker instalado.</p>

<p>Isso reduz drasticamente o tempo de deploy de alguma infraestrutura ou at&eacute; mesmo aplica&ccedil;&atilde;o, pois n&atilde;o h&aacute; necessidade de ajustes de ambiente para o correto funcionamento do servi&ccedil;o, o ambiente &eacute; sempre o mesmo, configure-o uma vez e replique-o quantas vezes quiser.</p>

<p>Outra facilidade do Docker &eacute; poder criar suas imagens (containers prontos para deploy) a partir de arquivos de defini&ccedil;&atilde;o chamados Dockerfiles (veremos isso melhor em posts futuros).</p>

<p>N&atilde;o podemos nos esquecer tamb&eacute;m de que o Docker utiliza como backend default o LXC, com isso &eacute; poss&iacute;vel definir limita&ccedil;&otilde;es de recursos por container (mem&oacute;ria, cpu, I/O, etc.)</p>

<p>Como ele trabalha utilizando cliente e servidor (toda a comunica&ccedil;&atilde;o entre o Docker Daemon e Docker client &eacute; realizada atrav&eacute;s de API), basta apenas que voc&ecirc; tenha instalado o servi&ccedil;o do Docker em um lugar, e aponte em seu Docker Client para esse servidor. A plataforma do Docker em si utilizada alguns conjuntos de recursos, seja para a cria&ccedil;&atilde;o ou administra&ccedil;&atilde;o dos containers, entre esses conjuntos podemos destacar a biblioteca libcontainer, que &eacute; respons&aacute;vel pela comunica&ccedil;&atilde;o entre o Docker Daemon e o backend utilizado, &eacute; ela a respons&aacute;vel pela cria&ccedil;&atilde;o do container, e &eacute; atrav&eacute;s dela que podemos setar os limites de recursos por container.</p>

<p><b>Cr&eacute;dito</b></p>

<p>https://www.mundodocker.com.br/o-que-e-docker/</p>

<p>No docker temos dois componentes principais, a imagem e o container.</p>

<p><b>Imagem</b></p>

<p>Uma imagem &eacute; um arquivo inerte, como uma imagem ISO de um sisema operacional. Ela geralmente cont&eacute;m o n&uacute;cleo de um sistema operacional, o n&uacute;cleo de um sistema com um ou mais servi&ccedil;os. Como por exemplo a imagem oficial &quot;ubuntu&quot;, que cont&eacute;m somente o n&uacute;cleo do Ubuntu na &uacute;ltima vers&atilde;o em 72,9MB. Como a imagem ribafs/ubuntu-maria, que cont&eacute;m a imagem ubuntu e o mariadb. A ribafs/ubunto-php, que cont&eacute;m a ubuntu o Apache, o PHP e extens&otilde;es. A ribafs/ubuntu, que cont&eacute;m o LAMP com a ubuntu. Uma imagem &eacute; um arquivo inerte.</p>

<p><b>Container</b></p>

<p>O container d&aacute; vida para uma imagem. &Eacute; como uma m&aacute;quina virtual que cria um sistema operacional dentro de um sistema operacional hospedeiro. O container permite que a imagem interaja com nosso sistema operacional. Definimos esta intera&ccedil;&atilde;o atrav&eacute;s dos arquivos docker-compose.yml e do Dockerfile.</p>

<p><b>docker-compose</b></p>

<p>O docker compose &eacute; uma forma de administrar v&aacute;rios containers, definindo em um &uacute;nico arquivo as configura&ccedil;&otilde;es para os diversos containers, no caso o docker-composer.yml que interage com o Dockerfile de cada container.</p>

<p><b>Estrutura do docker simplificada</b></p>

<p>- Aplicativos (so, apache, nginx, php, adminer, etc)<br />
- Docker<br />
- Sistema operacional hospedeiro (desktop ou servidor)<br />
- Infraestrutura (hardware, a base)</p>

<p>Exemplo:</p>

<p>- Imagem ou imagens (Ubuntu, Apache, PHP, MySQL)<br />
- Container<br />
- Meu sistema operacional (Linux, Windows, Mac, etc)<br />
- Meu computador</p>

<p><b>Pacote de software em unidades padronizadas para desenvolvimento, remessa e implanta&ccedil;&atilde;o.</b></p>

<p>Um cont&ecirc;iner &eacute; uma unidade padr&atilde;o de software que empacota o c&oacute;digo e todas as suas depend&ecirc;ncias para que o aplicativo seja executado de forma r&aacute;pida e confi&aacute;vel de um ambiente de computa&ccedil;&atilde;o para outro. Uma imagem de cont&ecirc;iner do Docker &eacute; um pacote de software leve, aut&ocirc;nomo e execut&aacute;vel que inclui tudo o que &eacute; necess&aacute;rio para executar um aplicativo: c&oacute;digo, tempo de execu&ccedil;&atilde;o, ferramentas do sistema, bibliotecas do sistema e configura&ccedil;&otilde;es.</p>

<p>As imagens de cont&ecirc;iner se tornam cont&ecirc;ineres no tempo de execu&ccedil;&atilde;o e, no caso de cont&ecirc;ineres Docker, as imagens se tornam cont&ecirc;ineres quando s&atilde;o executadas no Docker Engine. Dispon&iacute;vel para aplicativos baseados em Linux e Windows, o software em cont&ecirc;ineres sempre rodar&aacute; da mesma forma, independentemente da infraestrutura. Os cont&ecirc;ineres isolam o software de seu ambiente e garantem que ele funcione uniformemente, apesar das diferen&ccedil;as, por exemplo, entre o desenvolvimento e a prepara&ccedil;&atilde;o.</p>

<p><b>Cont&ecirc;ineres Docker executados no Docker Engine:</b></p>

<p>&nbsp;&nbsp;&nbsp; Padr&atilde;o: Docker criou o padr&atilde;o da ind&uacute;stria para cont&ecirc;ineres, para que eles pudessem ser transportados em qualquer lugar<br />
&nbsp;&nbsp;&nbsp; Leve: os cont&ecirc;ineres compartilham o kernel do sistema operacional da m&aacute;quina e, portanto, n&atilde;o exigem um sistema operacional por aplicativo, gerando maior efici&ecirc;ncia do servidor e reduzindo os custos do servidor e de licenciamento</p>

<p>&nbsp;&nbsp;&nbsp; Seguro: os aplicativos s&atilde;o mais seguros em cont&ecirc;ineres e o Docker fornece os recursos de isolamento padr&atilde;o mais fortes do setor</p>

<p>&nbsp;</p>


<p><b>Comparação do docker com uma máquina virtual tradicional</b></p>

<img src="dockerxvm.png" width="100%">

<p>Veja que cada VM contém o seu próprio sistema operacional, o que a torna mais lenta  .

<p>Docker se refere a muitas coisas. Isso inclui: um projeto da comunidade open source; as ferramentas resultantes desse projeto; a empresa Docker Inc., principal apoiadora do projeto; e as ferramentas compat&iacute;veis formalmente com a empresa. O fato de que as tecnologias e a empresa t&ecirc;m o mesmo nome pode causar uma certa confus&atilde;o.</p>

<p><b>Veja uma simples explica&ccedil;&atilde;o:</b></p>

<p>&nbsp;&nbsp;&nbsp; O software de TI &quot;Docker&rdquo; &eacute; uma tecnologia de containeriza&ccedil;&atilde;o para cria&ccedil;&atilde;o e uso de containers Linux&reg;.<br />
&nbsp;&nbsp;&nbsp; A comunidade open source do Docker trabalha gratuitamente para melhorar essas tecnologias para todos os usu&aacute;rios.<br />
&nbsp;&nbsp;&nbsp; A empresa Docker Inc. se baseia no trabalho realizado pela comunidade do Docker, tornando-o mais seguro, e compartilha os avan&ccedil;os com a comunidade em geral. Depois, ela oferece aos clientes corporativos o suporte necess&aacute;rio para as tecnologias que foram aprimoradas e fortalecidas.</p>

<p>Com o Docker, &eacute; poss&iacute;vel lidar com os containers como se fossem m&aacute;quinas virtuais modulares e extremamente leves. Al&eacute;m disso, os containers oferecem maior flexibilidade para voc&ecirc; criar, implantar, copiar e migrar um container de um ambiente para outro. Isso otimiza as aplica&ccedil;&otilde;es na cloud.</p>

<p>A tecnologia Docker usa o kernel do Linux e recursos do kernel como Cgroups e namespaces para segregar processos. Assim, eles podem ser executados de maneira independente. O objetivo dos containers &eacute; criar essa independ&ecirc;ncia: a habilidade de executar diversos processos e aplica&ccedil;&otilde;es separadamente para utilizar melhor a infraestrutura e, ao mesmo tempo, manter a seguran&ccedil;a que voc&ecirc; teria em sistemas separados.</p>

<p>As ferramentas de container, incluindo o Docker, fornecem um modelo de implanta&ccedil;&atilde;o com base em imagem. Isso facilita o compartilhamento de uma aplica&ccedil;&atilde;o ou conjunto de servi&ccedil;os, incluindo todas as depend&ecirc;ncias deles em v&aacute;rios ambientes. O Docker tamb&eacute;m automatiza a implanta&ccedil;&atilde;o da aplica&ccedil;&atilde;o (ou de conjuntos de processos que constituem uma aplica&ccedil;&atilde;o) dentro desse ambiente de container.</p>

<p>Essas ferramentas baseadas nos containers Linux (o que faz com que o Docker seja exclusivo e f&aacute;cil de usar) oferecem aos usu&aacute;rios acesso sem precedentes a aplica&ccedil;&otilde;es, al&eacute;m da habilidade de implantar com rapidez e de ter total controle sobre as vers&otilde;es e distribui&ccedil;&atilde;o.<br />
O Docker utiliza a mesma tecnologia que os containers Linux tradicionais?</p>

<p>N&atilde;o, a tecnologia Docker foi desenvolvida inicialmente com base na tecnologia LXC, que a maioria das pessoas associa aos containers Linux &quot;tradicionais&quot;. No entanto, desde ent&atilde;o, essa tecnologia tornou-se independente. O LXC era &uacute;til como uma virtualiza&ccedil;&atilde;o leve, mas n&atilde;o oferecia uma boa experi&ecirc;ncia para usu&aacute;rios e desenvolvedores. A tecnologia Docker oferece mais do que a habilidade de executar containers: ela tamb&eacute;m facilita o processo de cria&ccedil;&atilde;o e constru&ccedil;&atilde;o de containers, o envio e o controle de vers&atilde;o de imagens, dentre outras coisas.</p>

<p><b>As vantagens dos containers Docker</b><br />
<b>Modularidade</b></p>

<p>A abordagem do Docker para a containeriza&ccedil;&atilde;o se concentra na habilidade de desativar uma parte de uma aplica&ccedil;&atilde;o, seja para reparo ou atualiza&ccedil;&atilde;o, sem interromp&ecirc;-la totalmente. Al&eacute;m dessa abordagem baseada em microsservi&ccedil;os, &eacute; poss&iacute;vel compartilhar processos entre v&aacute;rias aplica&ccedil;&otilde;es da mesma maneira como na arquitetura orientada a servi&ccedil;o (SOA).<br />
Camadas e controle de vers&atilde;o de imagens</p>

<p>Cada arquivo de imagem Docker &eacute; composto por uma s&eacute;rie de camadas. Elas s&atilde;o combinadas em uma &uacute;nica imagem. Uma nova camada &eacute; criada quando h&aacute; altera&ccedil;&atilde;o na imagem. Toda vez que um usu&aacute;rio especifica um comando, como executar ou copiar, uma nova camada &eacute; criada.</p>

<p>O Docker reutiliza essas camadas para a constru&ccedil;&atilde;o de novos containers, o que torna o processo de cria&ccedil;&atilde;o muito mais r&aacute;pido. As altera&ccedil;&otilde;es intermedi&aacute;rias s&atilde;o compartilhadas entre imagens, o que melhora ainda mais a velocidade, o tamanho e a efici&ecirc;ncia. O controle de vers&otilde;es &eacute; inerente ao uso de camadas. Sempre que &eacute; realizada uma nova altera&ccedil;&atilde;o, &eacute; gerado um changelog integrado, o que fornece controle total sobre as imagens do container.<br />

<b>Revers&atilde;o</b></p>

<p>Talvez a melhor vantagem da cria&ccedil;&atilde;o de camadas seja a habilidade de reverter quando necess&aacute;rio. Toda imagem possui camadas. N&atilde;o gostou da itera&ccedil;&atilde;o atual de uma imagem? Simples, basta reverter para a vers&atilde;o anterior. Esse processo &eacute; compat&iacute;vel com uma abordagem de desenvolvimento &aacute;gil e possibilita as pr&aacute;ticas de integra&ccedil;&atilde;o e implanta&ccedil;&atilde;o cont&iacute;nuas (CI/CD) em rela&ccedil;&atilde;o &agrave;s ferramentas.<br />

<b>Implanta&ccedil;&atilde;o r&aacute;pida</b></p>

<p>Antigamente, colocar novo hardware em funcionamento, provisionado e dispon&iacute;vel, levava dias. E as despesas e esfor&ccedil;o necess&aacute;rios para mant&ecirc;-lo eram onerosos. Os containers baseados em docker podem reduzir o tempo de implanta&ccedil;&atilde;o de horas para segundos. Ao criar um container para cada processo, &eacute; poss&iacute;vel compartilhar rapidamente esses processos similares com novos aplicativos. Como n&atilde;o &eacute; necess&aacute;rio inicializar um sistema operacional para adicionar ou mover um container, o tempo de implanta&ccedil;&atilde;o &eacute; substancialmente menor. Al&eacute;m disso, com a velocidade de implanta&ccedil;&atilde;o, &eacute; poss&iacute;vel criar dados e destruir os criados pelos containers sem nenhuma preocupa&ccedil;&atilde;o e com facilidade e economia.</p>

<p>Em resumo, a tecnologia Docker &eacute; uma abordagem mais granular, control&aacute;vel e baseada em microsservi&ccedil;os que valoriza a efici&ecirc;ncia.</p>

<p><b>Host &eacute; a m&aacute;quina onde &eacute; instalado o docker</b></p>

<p>No host podemos instalara diversas imagens e diversos containers.</p>

<p><b>Cr&eacute;dito</b></p>

<p>https://www.redhat.com/pt-br/topics/containers/what-is-docker</p>
                    </div>
                </div>
            </div>
          </div>
        </div>

      </div>
    </section><!-- End About Us Section -->

  <!-- ======= Footer ======= -->
  <footer id="footer">

    <div class="container footer-bottom clearfix">
      <div class="copyright">
        &copy; Copyright <strong><span>Knight</span></strong>. All Rights Reserved
      </div>
      <div class="credits">
        <!-- All the links in the footer should remain intact. -->
        <!-- You can delete the links only if you purchased the pro version. -->
        <!-- Licensing information: https://bootstrapmade.com/license/ -->
        <!-- Purchase the pro version with working PHP/AJAX contact form: https://bootstrapmade.com/knight-free-bootstrap-theme/ -->
        Designed by <a href="https://bootstrapmade.com/">BootstrapMade</a>
      </div>
    </div>
  </footer><!-- End Footer -->

  <a href="#" class="back-to-top"><i class="icofont-simple-up"></i></a>

  <!-- Vendor JS Files -->
  <script src="../assets/vendor/jquery/jquery.min.js"></script>
  <script src="../assets/vendor/jquery.easing/jquery.easing.min.js"></script>
  <script src="../assets/vendor/jquery-sticky/jquery.sticky.js"></script>
  <script src="../assets/vendor/isotope-layout/isotope.pkgd.min.js"></script>
  <script src="../assets/vendor/owl.carousel/owl.carousel.min.js"></script>
  <script src="../assets/vendor/aos/aos.js"></script>

  <!-- Template Main JS File -->
  <script src="../assets/js/main.js"></script>

</body>

</html>
